---
kind: property
id: P:Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandRailPosition
source: html/02c508e5-b110-3779-a393-a9930ada4aff.htm
---
# Autodesk.Revit.DB.Architecture.RailingType.PrimaryHandRailPosition Property

The position of the primary handrail.

## Syntax (C#)
```csharp
public HandRailPosition PrimaryHandRailPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The rail has no primary hand rail.